---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures
source: html/f8c149f0-167d-7a43-d833-f9043819eb88.htm
---
# BuiltInFailures.GlobalParameterFailures Properties

Linked properties in highlighted elements cause a circular chain of references.